# -*- coding: utf-8 -*-

# Игра «Быки и коровы»
# https://goo.gl/Go2mb9
#
# Правила:
# Компьютер загадывает четырехзначное число, все цифры которого различны
# (первая цифра числа отлична от нуля). Игроку необходимо разгадать задуманное число.
# Игрок вводит четырехзначное число c неповторяющимися цифрами,
# компьютер сообщают о количестве «быков» и «коров» в названном числе
# «бык» — цифра есть в записи задуманного числа и стоит в той же позиции,
#       что и в задуманном числе
# «корова» — цифра есть в записи задуманного числа, но не стоит в той же позиции,
#       что и в задуманном числе
#
# Например, если задумано число 3275 и названо число 1234,
# получаем в названном числе одного «быка» и одну «корову».
# Очевидно, что число отгадано в том случае, если имеем 4 «быка».
#
# Формат ответа компьютера
# > быки - 1, коровы - 1


# Составить отдельный модуль mastermind_engine, реализующий функциональность игры.
# В mastermind_engine нужно реализовать функции:
#   загадать_число()
#   проверить_число(NN) - возвращает словарь {'bulls': N, 'cows': N}
# Загаданное число хранить в глобальной переменной.
# Обратите внимание, что строки - это список символов.
#
# В текущем модуле (lesson_006/01_mastermind.py) реализовать логику работы с пользователем:
#   модуль движка загадывает число
#   в цикле, пока число не отгадано
#       у пользователя запрашивается вариант числа
#       проверяем что пользователь ввел допустимое число (4 цифры, все цифры разные, не начинается с 0)
#       модуль движка проверяет число и выдает быков/коров
#       результат быков/коров выводится на консоль
#  когда игрок угадал таки число - показать количество ходов и вопрос "Хотите еще партию?"
#
# При написании кода учитывайте, что движок игры никак не должен взаимодействовать с пользователем.
# Все общение с пользователем (вывод на консоль и запрос ввода от пользователя) делать в 01_mastermind.py.
# Движок игры реализует только саму функциональность игры. Разделяем: mastermind_engine работает
# только с загаданным числом, а 01_mastermind - с пользователем и просто передает числа на проверку движку.
# Это пример применения SOLID принципа (см https://goo.gl/GFMoaI) в архитектуре программ.
# Точнее, в этом случае важен принцип единственной ответственности - https://goo.gl/rYb3hT

from termcolor import cprint, colored
from mastermind_engine import get_hidden_number, checking_number, number_bulls_cows


while True:
    get_hidden_number()
    print('\nЗагадано 4-х значное число (все цифры разные, не начинается с 0)')
    number_attempts = 0
    while True:
        while True:
            number_to_check = input('Введите ваше число (все цифры разные, не начинается с 0): ')
            if checking_number(number_to_check):
                break
            else:
                cprint('Вы ввели недопустимое число! ', color='red', on_color='on_cyan')
        bulls_cows = number_bulls_cows(number_to_check)
        print('В вашем числе быков: {bulls}, коров: {cows} '.format(bulls=bulls_cows['bulls'], cows=bulls_cows['cows']))
        number_attempts += 1
        if bulls_cows['bulls'] == 4:
            print(colored('Вы угадали число! Количество ходов:', color='blue'),
                  colored(number_attempts, color='blue'))
            new_game = input('Сыграть ещё раз? 1 - да, 0 - нет: ')
            break
    if new_game != '1':
        break
cprint('\nИгра окончена.', color='red', attrs=['bold', 'underline'])
